/**
  ******************************************************************************
  * @file    Module_DLT.c
  * @author  Donatello
  * @version V1.0
  * @date    2015.9.16
  * @brief
  ******************************************************************************
  */
/*
*********************************************************************************************************
*                                             INCLUDE FILES
*********************************************************************************************************
*/
#include "Module_DLT.h"

DLTDat std;
/* Public  functions ---------------------------------------------------------*/
/*******************************************************************************
  * @函数名称		DltStart
  * @函数说明		主站发送帧信息之前，唤醒从站
  * @输入参数		无
  * @输出参数		无
  * @返回参数		无
*******************************************************************************/
void DltStart(void)
{
    UART_Puts (LPC_UART0,DLT_wakeup,4);
}
/*******************************************************************************
  * @函数名称		ReadData
  * @函数说明		读取电能表的数据
  * @输入参数		无
  * @输出参数		无
  * @返回参数		无
*******************************************************************************/
void ReadData(DLT_ENUM dlt)
{
    DltStart();
    uint8_t data[16] = {0X68,0XAA,0XAA,0XAA,0XAA,0XAA,0XAA,0X68,0X11,0X04,0X33,0X34,0x34,0x35,0xB1,0x16};
    uint16_t Send_len = 0;
    switch(dlt)
    {
        case DLT_Vol://02 01 01 00
            {
                data[10] = 0x00 + 0x33;
                data[11] = 0x01 + 0x33;
                data[12] = 0x01 + 0x33;
                data[13] = 0x02 + 0x33;
                Send_len = 16;
                break;
            }
        case DLT_Cur://02 02 01 00
            {
                data[10] = 0x00 + 0x33;
                data[11] = 0x01 + 0x33;
                data[12] = 0x02 + 0x33;
                data[13] = 0x02 + 0x33;
                Send_len = 16;
                break;
            }
        case DLT_Eng://00 01 00 00
            {
                data[10] = 0x00 + 0x33;
                data[11] = 0x00 + 0x33;
                data[12] = 0x01 + 0x33;
                data[13] = 0x00 + 0x33;
                Send_len = 16;
                break;
            }
        case DLT_Addr:
            {
                data[9]  = 0x13;
                data[10] = 0x00;
                Send_len = 12;
                break;
            }
    }
    data[Send_len] = 0x16;
    data[Send_len-2] = crcCheck_MOD(data,Send_len-2);
    UART_Puts (LPC_UART0,data,Send_len);
}


/* Private functions ---------------------------------------------------------*/

